# StairsWinderpatternMinimumWidthCorner Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsWinderpatternMinimumWidthCorner Property
ParameterTypeId Class See Also
---
"Minimum Width on Inside Boundary": Minimum Width on Inside Boundary
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsWinderpatternMinimumWidthCorner { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsWinderpatternMinimumWidthCorner As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsWinderpatternMinimumWidthCorner {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace